print('Задача 4. Первая цифра')

# Дано положительное действительное число X. 
# Выведите его первую цифру после десятичной точки. 
# При решении этой задачи нельзя пользоваться условной инструкцией, циклом или строками
x=10*round(float(input('Введите число X: ')),2)
print (int(x%10*10//10)	)