print('Задача 7. Маятник ')

# Известно, что амплитуда качающегося маятника с каждым разом затухает
# на 8,4% от амплитуды прошлого колебания. 
# Если качнуть маятник,
# то, строго говоря, он не остановится никогда, 
# просто амплитуда будет постоянно уменьшаться до тех пор, 
# пока мы не сочтём такой маятник остановившимся. 
 
# Напишите программу, 
# определяющую, сколько раз качнётся маятник, прежде чем он, по нашему мнению, остановится. 
 
# Программа получает на вход
# начальную амплитуду колебания в сантиметрах 
# и конечную амплитуду его колебаний,
# которая считается остановкой маятника. 

# Обеспечьте контроль ввода.

# Пример:

# Введите начальную амплитуду: 1
# Введите амплитуду остановки: 0.1
 
# Маятник считается остановившимся через 27 колебаний

#begin_amp=int(input('Введите начальную амплитуду: '))
begin_amp=1
#stop_amp=int(input('Введите амплитуду остановки: '))
stop_amp=0.1
count=0
while begin_amp > stop_amp:
    begin_amp-=begin_amp-begin_amp*(100-8.4)/100
    count+=1
print ('Маятник считается остановившимся через ', count, 'колебаний')
